# 혼공파 1강
# print ("Hello Python")
# print ("Hello!" * 3)

# 혼공파 2강
# print ("안시연\t 21살\t 서울특별시 노원구")
# print ("아롬이는 귀여워\n아롬이는 천사야 \n아롬이는 세상에서 제일 예뻐")

# Enter 키 여러 줄 문자열
# print ("""아롬이는 귀여워
# 아롬이는 천사야
# 아롬이는 세상에서 제일 귀여워""")
# 컴퓨터는 1부터 시작이 아닌 0부터 시작
# []는 연산자, 연산자를 이용해 특정 위치의 문자를 참조하는 것은 인덱싱 [:]연산자를 이용해 문자열의 일부를 추출하는 것을 슬라이상
# print ("귀여워"[0])
# print ("귀여워"[1])
# print ("귀여워"[2])
# print ("귀여워"[2])
# print ("귀여워"[1])
# print ("귀여워"[0])
# len()함수를 사용하면 문자열의 길이를 구할 수 있음(띄어쓰기도 한 글자)
# print (len("안녕하십까 여러분"))
# print("# 연습 문제")
# print("\\\\\\\\")
# print ("-"*8)
# print("안녕하세요"[1])
# print("안녕하세요"[2])
# print("안녕하세요"[3])
# print("안녕하세요"[4])
# print("안녕하세요"[5])
# print("안녕하세요"[1:3])
# print("안녕하세요"[2:4])
# print("안녕하세요"[1:])
# print("안녕하세요"[:3])
# print("# 기본적인 연산")
# print(15, "+", 4, "=", 15 + 4)
# print(15, "-", 4, "=", 15 - 4)
# print(15, "*", 4, "=", 15 * 4)
# print(15, "/", 4, "=", 15 / 4)
# ""안의 텍스트는 계산하지 마세요
# print("-몫:", 9542//19)
# print("-나머지:", 9542%19)
# print(2+2-2*2/2*2)
# print(2-2+2/2*2+2)
# 변수 선언과 할당
# pi = 3.14159265
# r = 10
# # 변수 참조
# print("원주율 =", pi)
# print("반지름 =", r)
# print("원의 둘레 =", 2*pi*r) #원의 둘레
# print("원의 넓이 =", pi*r*r) #원의 넓이
#string은 문자열 ,int 정수 ,boll 참과거짓 ,float 실수 =>자료형
# 입력을 받습니다.
# 52273은 문자(string)야 라고 세뇌를 시킴..나야 string... 
# string = input("입력>")
# 출력합니다
# print("자료:", string)
# print("자료형:", type(string)) type이란 함수는 string의 자료형을 확인하는 용도
# 입력을 받습니다.
# p120~153 직접 해보는 손코딩과 과제는 추후에..^^

